admbase/src/Documents/ЗаявкиDMC/ЗаявкиDMC.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиDMC</name>
  <registerRecords>InformationRegister.УчетРабочегоВремениСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.ПричиныОтсутсвия</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремениСотрудников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВходДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрисутствиеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноРабочееВремяДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноРабочееВремяЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноСверхРабочееВремяДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноСверхРабочееВремяЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочееВремяЗаТерриториейДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочееВремяЗаТерриториейЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтпускБольничныйУвольнениеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтпускБольничныйУвольнениеЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДатой</name>
    <comment>Время начала датой из ДО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияДатой</name>
    <comment>Время окончания датой из ДО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыход</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеЗаявкиНомерСтроки</name>
    <comment>Номер строки документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтсутствия</name>
    <type>
      <types>CatalogRef.ПричиныОтсутсвия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъяснительнаяЗаписка</name>
    <type>
      <types>DocumentRef.ОбъяснительнаяЗаписка</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаDMC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаDMC</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаERP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаERP</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>EnumRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DocumentRef.РасчетРабочегоВремени</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Enums/ЗаданияРасчета/ЗаданияРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗаданияРасчета</name>
  <enumValues>
    <name>ЗагрузкаДанныхПроходовРогачево</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанныхПроходовМосква</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДокументовERP</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДокументовDMC</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОбъяснений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольСпискаСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаГрафиковРаботы</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаИндивидуальныхГрафиковРаботы</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаСостоянияСотрудников</name>
  </enumValues>
  <enumValues>
    <name>РасчетРабочегоВремени</name>
  </enumValues>
</mdclass:Enum>

admbase/src/Documents/ЗаявкиDMC/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//1. Формируем общую таблицу заявок на каждую дату
//2. Вытесняем задвоенные заявки самой поздней заявкой
//3. Формируем таблицу движений

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата",		'00010101');
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаявкиDMCИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ЗаявкиDMCИсходныеДанные.ДатаНачала КАК Дата,
	|	ЗаявкиDMCИсходныеДанные.НомерСтроки КАК СодержаниеЗаявкиНомерСтроки,
	|	ЗаявкиDMCИсходныеДанные.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ЗаявкиDMCИсходныеДанные.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиDMCИсходныеДанные.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|	ЗаявкиDMCИсходныеДанные.ВремяНачала КАК ВремяНачалаДатой,
	|	РАЗНОСТЬДАТ(&ПустаяДата, ЗаявкиDMCИсходныеДанные.ВремяНачала, СЕКУНДА) КАК ВремяНачалаЧислом,
	|	ЗаявкиDMCИсходныеДанные.ВремяОкончания КАК ВремяОкончанияДатой,
	|	РАЗНОСТЬДАТ(&ПустаяДата, ЗаявкиDMCИсходныеДанные.ВремяОкончания, СЕКУНДА) КАК ВремяОкончанияЧислом,
	|	ЗаявкиDMCИсходныеДанные.НомерСтроки КАК СтрокаДокумента,
	|	ЗаявкиDMCИсходныеДанные.Ссылка КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА ЗаявкиDMCИсходныеДанные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ЗаявкиDMCИсходныеДанные.ДатаНачала, КОНЕЦПЕРИОДА(ЗаявкиDMCИсходныеДанные.ДатаНачала, МЕСЯЦ), ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкиDMCИсходныеДанные.ДатаНачала, ЗаявкиDMCИсходныеДанные.ДатаОкончания, ДЕНЬ)
	|	КОНЕЦ КАК РазностьДат,
	|	ЗаявкиDMCИсходныеДанные.ДатаОкончания КАК ДатаОкончания,
	|	ЗаявкиDMCИсходныеДанные.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Документ.ЗаявкиDMC.ИсходныеДанные КАК ЗаявкиDMCИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкиDMC КАК ЗаявкиDMC
	|		ПО ЗаявкиDMCИсходныеДанные.Ссылка = ЗаявкиDMC.Ссылка
	|ГДЕ
	|	ЗаявкиDMCИсходныеДанные.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Для каждого Колонка Из  Результат.Колонки Цикл
		ТаблицаЗначений.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);
	КонецЦикла;
	
	ЗаполнитьТаблицуДвиженийБезПрогулов(Результат.Выбрать(),ТаблицаЗначений);
	
	Запрос.УстановитьПараметр("ТаблицаЗначений",ТаблицаЗначений);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаЗначений.Сотрудник КАК Сотрудник,
	|	ТаблицаЗначений.Дата КАК Дата,
	|	ТаблицаЗначений.СодержаниеЗаявкиНомерСтроки КАК СодержаниеЗаявкиНомерСтроки,
	|	ТаблицаЗначений.РегистрационныйНомер КАК НомерДокументаDMC,
	|	ТаблицаЗначений.ДатаДокумента КАК ДатаДокументаDMC,
	|	ТаблицаЗначений.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|	ТаблицаЗначений.ВремяНачалаДатой КАК ВремяНачалаДатой,
	|	ТаблицаЗначений.ВремяНачалаЧислом КАК ВремяНачалаЧислом,
	|	ТаблицаЗначений.ВремяОкончанияДатой КАК ВремяОкончанияДатой,
	|	ТаблицаЗначений.ВремяОкончанияЧислом КАК ВремяОкончанияЧислом,
	|	ТаблицаЗначений.СтрокаДокумента КАК СтрокаДокумента,
	|	ТаблицаЗначений.ДокументДвижения КАК ДокументДвижения
	|ПОМЕСТИТЬ ТаблицаЗначений
	|ИЗ
	|	&ТаблицаЗначений КАК ТаблицаЗначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗначений.Сотрудник КАК Сотрудник,
	|	ТаблицаЗначений.Дата КАК Дата,
	|	МАКСИМУМ(ТаблицаЗначений.НомерДокументаDMC) КАК НомерДокументаDMC
	|ПОМЕСТИТЬ Отсекающая
	|ИЗ
	|	ТаблицаЗначений КАК ТаблицаЗначений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗначений.Сотрудник,
	|	ТаблицаЗначений.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗначений.Сотрудник КАК Сотрудник,
	|	ТаблицаЗначений.Дата КАК Дата,
	|	ТаблицаЗначений.СодержаниеЗаявкиНомерСтроки КАК СодержаниеЗаявкиНомерСтроки,
	|	ТаблицаЗначений.НомерДокументаDMC КАК НомерДокументаDMC,
	|	ТаблицаЗначений.ДатаДокументаDMC КАК ДатаДокументаDMC,
	|	ТаблицаЗначений.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|	ТаблицаЗначений.ВремяНачалаДатой КАК ВремяНачалаДатой,
	|	ТаблицаЗначений.ВремяНачалаЧислом КАК ВремяНачалаЧислом,
	|	ТаблицаЗначений.ВремяОкончанияДатой КАК ВремяОкончанияДатой,
	|	ТаблицаЗначений.ВремяОкончанияЧислом КАК ВремяОкончанияЧислом,
	|	ТаблицаЗначений.СтрокаДокумента КАК СтрокаДокумента,
	|	ТаблицаЗначений.ДокументДвижения КАК ДокументДвижения
	|ИЗ
	|	ТаблицаЗначений КАК ТаблицаЗначений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Отсекающая КАК Отсекающая
	|		ПО ТаблицаЗначений.Сотрудник = Отсекающая.Сотрудник
	|			И ТаблицаЗначений.Дата = Отсекающая.Дата
	|			И ТаблицаЗначений.НомерДокументаDMC = Отсекающая.НомерДокументаDMC
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата";

	
	
	Движения.УчетРабочегоВремениСотрудников.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.УчетРабочегоВремениСотрудников.Записывать = Истина;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат
	КонецЕсли;
	
	ЗаданияРасчета  = Перечисления.ЗаданияРасчета.ЗагрузкаДокументовDMC;
	КонсолидацияРегистрЗаданий.ЗаписатьПервичныеДанныеВРегистрЗаданий(Отказ,ЗаданияРасчета,Ссылка,Дата,Проведен,ПометкаУдаления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	Процедура ЗаполнитьТаблицуДвиженийБезПрогулов(Выборка,ТаблицаДвижений)

	Пока Выборка.Следующий() Цикл
		
		Для Счетчик = 0 По Выборка.РазностьДат Цикл
			
			НовоеДвижение = ТаблицаДвижений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовоеДвижение,Выборка);
			НовоеДвижение.Дата 			= Выборка.ДатаНачала + (86400 * Счетчик);
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
